#ifndef _DRAW_TETRIS_H_
#define _DRAW_TETRIS_H_

#include "header.h"
#include "console.h"


class DrawTetris {
public:
	DrawTetris();
	void start(void); //启动游戏
	void DrawScoreAndLevel(void); // 绘制得分和难度级别
	void DrawNext(void); // 绘制 "next框" 中的图形
	void DrawOver(void); // 游戏结束
	void DrawBlock(WORD color);  //画砖块
	bool InRange(int x, int y, int c, int z); // 给定的x,y,c,z是否可行
	void RemoveRow(void); // 消行
	void MoveTrans(void); // 逆时针翻转
	void MoveLeft(void);  // 向左移
	void MoveRight(void); // 向右移
	void MoveDown(void); // 向下移
	void DealKey(void); // 监听键盘，响应按键

private:
	int score, level;
	char data[19][11];
	int next;
	int x, y, c, z; // x坐标,y坐标,c当前方块,z方向
    Console console;
};

const WORD COLOR_A = /*FOREGROUND_GREEN|FOREGROUND_BLUE|FOREGROUND_INTENSITY;*/FOREGROUND_GREEN | FOREGROUND_RED | FOREGROUND_INTENSITY;
const WORD COLOR_B = FOREGROUND_GREEN | FOREGROUND_INTENSITY; //落到底部的方块是 绿色
const WORD COLOR_C = FOREGROUND_GREEN | FOREGROUND_RED | FOREGROUND_BLUE; //正下落的方块是 黄色
const char FULLLINE[] = { 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1 };



const char bg[] =
"┏━━━━━━━━━━━┓              "
"┃■■■■■■■■■■■┃  ←↓→↑    "
"┃■■■■■■■■■■■┃ MUSIC:       "
"┃■■■■■■■■■■■┃   ▌▌: =    "
"┃■■■■■■■■■■■┃    ▼ : -    "
"┃■■■■■■■■■■■┃  PLAY: Enter "
"┃■■■■■■■■■■■┃ PAUSE: Space "
"┃■■■■■■■■■■■┃  QUIT: Esc   "
"┃■■■■■■■■■■■┃ ＮＥＸＴ     "
"┃■■■■■■■■■■■┃┏━━━━┓  "
"┃■■■■■■■■■■■┃┃　　　　┃  "
"┃■■■■■■■■■■■┃┃　　　　┃  "
"┃■■■■■■■■■■■┃┗━━━━┛  "
"┃■■■■■■■■■■■┃ ＬＥＶＥＬ   "
"┃■■■■■■■■■■■┃┏━━━━┓  "
"┃■■■■■■■■■■■┃┃       0┃  "
"┃■■■■■■■■■■■┃┗━━━━┛  "
"┃■■■■■■■■■■■┃ ＳＣＯＲＥ   "
"┃■■■■■■■■■■■┃┏━━━━┓  "
"┃■■■■■■■■■■■┃┃   00000┃  "
"┗━━━━━━━━━━━┛┗━━━━┛  ";

const char bk[7][4][4][4] = {
	{
		{ { 0, 1, 1, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 0, 0, 0 }, { 1, 1, 0, 0 }, { 0, 1, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 0, 1, 1, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 0, 0, 0 }, { 1, 1, 0, 0 }, { 0, 1, 0, 0 }, { 0, 0, 0, 0 } }
	}
	,
	{
		{ { 1, 1, 0, 0 }, { 0, 1, 1, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 0, 1, 0, 0 }, { 1, 1, 0, 0 }, { 1, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 1, 0, 0 }, { 0, 1, 1, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 0, 1, 0, 0 }, { 1, 1, 0, 0 }, { 1, 0, 0, 0 }, { 0, 0, 0, 0 } }
	}
	,
	{
		{ { 1, 1, 1, 0 }, { 1, 0, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 0, 0, 0 }, { 1, 0, 0, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 0, 0, 1, 0 }, { 1, 1, 1, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 1, 0, 0 }, { 0, 1, 0, 0 }, { 0, 1, 0, 0 }, { 0, 0, 0, 0 } }
	}
	,
	{
		{ { 1, 1, 1, 0 }, { 0, 0, 1, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 1, 0, 0 }, { 1, 0, 0, 0 }, { 1, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 0, 0, 0 }, { 1, 1, 1, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 0, 1, 0, 0 }, { 0, 1, 0, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 } }
	}
	,
	{
		{ { 1, 1, 0, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 1, 0, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 1, 0, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 1, 0, 0 }, { 1, 1, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } }
	}
	,
	{
		{ { 0, 1, 0, 0 }, { 1, 1, 1, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 0, 1, 0, 0 }, { 1, 1, 0, 0 }, { 0, 1, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 1, 1, 0 }, { 0, 1, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 0, 0, 0 }, { 1, 1, 0, 0 }, { 1, 0, 0, 0 }, { 0, 0, 0, 0 } }
	}
	,
	{
		{ { 1, 1, 1, 1 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 0, 0, 0 }, { 1, 0, 0, 0 }, { 1, 0, 0, 0 }, { 1, 0, 0, 0 } },
		{ { 1, 1, 1, 1 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 }, { 0, 0, 0, 0 } },
		{ { 1, 0, 0, 0 }, { 1, 0, 0, 0 }, { 1, 0, 0, 0 }, { 1, 0, 0, 0 } }
	}
};


#endif /* _DRAW_TETRIS_H_ */